var local_database = [
    {
        date: "Sep 18 2017",
        title: "红楼梦",
        imgSrc: "/images/post/hl.jpg",
        avatar: "/images/avatar/1.png",
        content: "《红楼梦》，中国古典四大名著之首，清代作家曹雪芹创作的章回体长篇小说，又名《石头记》《金玉缘》。",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/post/hl.jpg",
        author: "林衣",
        dateTime: "24小时前",
        detail: "《红楼梦》是一部内涵丰厚的作品，《好了歌》和《红楼梦十二支曲》提示着贾宝玉所经历的三重悲剧。作者将贾宝玉和一群身份、地位不同的少女放在大观园这个既是诗化的、又是真实的小说世界里，来展示她们的青春生命和美的被毁灭的悲剧。作品极为深刻之处在于，并没有把这个悲剧完全归于恶人的残暴，其中一部分悲剧是封建势力的直接摧残，如鸳鸯、晴雯、司棋这些人物的悲惨下场，但是更多的悲剧是封建伦理关系中的“通常之道德、通常之人情、通常之境遇”所造成的，是几千年积淀而凝固下来的正统文化的深层结构造成的人生悲剧。小说描绘了上至皇宫、下及乡村的广阔历史画面，广泛而深刻地反映了封建末世复杂深刻的矛盾冲突，显示了封建贵族的本质特征和必然衰败的历史命运。尤其深刻的是，在小说展示的贾府的生活图画里，显示出维持着这个贵族之家的等级、名分、长幼、男女等关系的礼法习俗的荒谬，揭开了封建家族“温情脉脉面纱”内里的种种激烈的矛盾和斗争。",
        postId: 0,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
            title: "夜夜夜夜-齐秦",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
        }
    },
    {
        title: "西游记",
        content: "该剧讲述的是孙悟空、猪八戒、沙僧辅保大唐高僧玄奘去西天取经，师徒四人一路抢滩涉险，降妖伏怪，历经八十一难，取回真经，终修正果的故事。",
        imgSrc: "/images/post/xy.jpg",
        reading: 62,
        detail: "《西游记》塑造了四个鲜明的人物形象：唐僧－诚心向佛、顽固执着，孙悟空－正义大胆、本领高超是妖怪们的克星，猪八戒－贪财好色，但又不缺乏善心，沙僧－心地善良、安于天命。这四个人物形象各有特点，性格各不相同，恰好形成了鲜明的对比，这使我不得不佩服作者写作技艺的高超，也许作者善于刻画人物形象便是他的精妙之处。其中我最喜欢的便是孙悟空，因为他神通广大、技艺高超，一路保护唐僧成功地取得了真经，他就成了我心目中的英雄。而且在他身上还有一种叛逆心理，以及他敢于和强大势力做斗争的勇敢的精神令我十分欣赏。 ",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/xy.jpg",
        author: "迷城",
        date: "Nov 20 2017",
        avatar: "/images/avatar/1.png",
        postId: 1,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
            title: "鬼迷心窍-李宗盛",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "三国演义",
        content: "《三国演义》是中国古典四大名著之一，是中国第一部长篇章回体历史演义小说，全名为《三国志通俗演义》（又称《三国志演义》），作者是元末明初的著名小说家罗贯中。《三国志通俗演义》成书后有嘉靖壬午本等多个版本传于世，到了明末清初，毛宗岗对《三国演义》整顿回目、修正文辞、改换诗文。",
        detail: "《三国演义》反映了丰富的历史内容，人物名称、地理名称、主要事件与《三国志》基本相同。人物性格也是在《三国志》留下的固定形象基础上，才进行再发挥，进行夸张、美化、丑化等等，这也是历史演义小说的套路。《三国演义》一方面反映了较为真实的三国历史，照顾到读者希望了解真实历史的需要；另一方面，根据明朝社会的实际情况对三国人物进行了夸张、美化、丑化等等。故事远起汉灵帝年间刘、关、张桃园结义，描述了东汉末年和三国时期近百年发生的重大历史事件，和众多的叱咤风云的英雄人物。作者通过真实动人的故事，揭示了封建统治阶级内部的黑暗和腐朽，控诉了统治者的暴虐和丑恶。东汉末年，军阀混战，所谓“十八路”诸侯联军征讨董卓，打的是“扶持王室，拯救黎民”的旗号，干的是勾心斗角、尔虞我诈的勾当，都企图称王称霸。《三国演义》以没落的汉室宗亲刘备和以宗族起兵的曹操作为两条主线的展开了中前期的故事，而中后期以大汉丞相诸葛亮率领汉军北伐，与魏国重臣司马懿的斗智斗勇为主线，以三国归晋而告终。",
        imgSrc: "/images/post/sg.jpg",
        headImgSrc: "/images/post/sg.jpg",
        reading: 62,
        collection: 92,
        author: "六六",
        date: "Nov 12 2016",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
            title: "女儿情-万晓利",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
        }
    },
    {
        title: "水浒装",
        content: "《水浒传》，是中国四大名著之一，是一部描写宋江起义的长篇小说。明朝万历二十二年（1594）福建建阳余象斗双峰堂刊本《京本增补校正全像忠义水浒志传评林》题罗贯中编集，明万历四十二年（1614）袁无涯刊《忠义水浒全传》一百二十回本署名是“施耐庵集撰、罗贯中纂修”，与之相近的还有明万历三十年（1602）前后容与堂刻本《水浒传》署名是“施耐庵撰，罗贯中纂修”。",
        imgSrc: "/images/post/sh.jpg",
        reading: 96,
        detail: "《水浒传》描写北宋末年以宋江为首的108位好汉在梁山聚义，以及聚义之后接受招安、四处征战的故事。全书以农民起义的发生、发展过程为主线，通过各个英雄被逼上梁山的不同经历，描写出他们由个体觉醒到走上小规模联合反抗，到发展为盛大的农民起义队伍的全过程，表现了“官逼民反”这一封建时代农民起义的必然规律，塑造了农民起义领袖的群体形象，深刻反映出北宋末年的政治状况和社会矛盾。作者站在被压迫者一边，歌颂了农民起义领袖们劫富济贫、除暴安良的正义行为，肯定了他们敢于造反、敢于斗争的革命精神。宋江原是一位周急扶困的义士，当他被逼上梁山之后，“替天行道”，壮大了起义军的声威，取得了一系列胜利。但由于他性格的二重性和思想的局限性，在起义事业登上峰巅之时选择了妥协、招安，最终葬送了起义事业。小说通过宋江起义的失败客观上总结了封建时代农民起义失败的经验教训。小说以高俅发迹作为故事的开端，意在表明“乱自上作”，高俅是封建统治集团的代表人物。作者还写了大批的贪官污吏和地方恶霸，正是他们狼狈为奸，鱼肉百姓，才迫使善良而正直的人们不得不挺而走险，奋起反抗。小说深刻地挖掘出了封建时代农民起义的深层原因。",
        collection: 26,
        dateTime: "21小时前",
        headImgSrc: "/images/post/sh.jpg",
        author: "深白色",
        date: "Nov 20 2017",
        avatar: "../../../images/avatar/5.png",
        postId: 5,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
            title: "朋友-谭咏麟",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
        }
    },
]

module.exports = {
    postList: local_database
}